# Getting started with pandas

In [2]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [3]:
%pwd

u'/home/sebas/dev/training/master-data-science/07_pandas_for_data_science'

# Numpy Array

In [4]:
plainlist = [x for x in range(1,1000000)]

In [5]:
plainlist[1]

2

In [6]:
%time map(lambda number: number+1,plainlist)[1]

CPU times: user 116 ms, sys: 4 ms, total: 120 ms
Wall time: 246 ms

3

In [7]:
numpyarray = np.array(plainlist)

In [8]:
%time (numpyarray+1)[1]

CPU times: user 0 ns, sys: 8 ms, total: 8 ms
Wall time: 10.3 ms

3

## Introduction to pandas data structures

### Series

In [9]:
obj = Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [10]:
print obj.values
print obj.index

[ 4  7 -5  3]
Int64Index([0, 1, 2, 3], dtype='int64')

In [11]:
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [12]:
obj2.index

Index([u'd', u'b', u'a', u'c'], dtype='object')

In [13]:
obj2['a']

-5

In [14]:
obj2['d'] = 6
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

In [15]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [16]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [17]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [18]:
'b' in obj2

True

In [19]:
'e' in obj2

False

In [20]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = Series(sdata)
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [21]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = Series(sdata, index=states)
obj4

California      NaN
Ohio          35000
Oregon        16000
Texas         71000
dtype: float64

In [22]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [23]:
obj4

California      NaN
Ohio          35000
Oregon        16000
Texas         71000
dtype: float64

In [24]:
obj3 + obj4

California       NaN
Ohio           70000
Oregon         32000
Texas         142000
Utah             NaN
dtype: float64

In [25]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California      NaN
Ohio          35000
Oregon        16000
Texas         71000
Name: population, dtype: float64

In [26]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### DataFrame

In [27]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = DataFrame(data)

In [28]:
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [29]:
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [30]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                   index=['one', 'two', 'three', 'four', 'five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [31]:
frame2.columns

Index([u'year', u'state', u'pop', u'debt'], dtype='object')

In [32]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [33]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [34]:
frame2.ix['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [35]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [36]:
frame2['debt'] = np.arange(5.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4

In [37]:
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [38]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt eastern
one    2000    Ohio  1.5   NaN    True
two    2001    Ohio  1.7  -1.2    True
three  2002    Ohio  3.6   NaN    True
four   2001  Nevada  2.4  -1.5   False
five   2002  Nevada  2.9  -1.7   False

In [39]:
del frame2['eastern']
frame2.columns

Index([u'year', u'state', u'pop', u'debt'], dtype='object')

In [40]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [41]:
frame3 = DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [42]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [43]:
DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [44]:
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [45]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [46]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [47]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7]], dtype=object)

### Index objects

In [48]:
obj = Series(range(3), index=['a', 'b', 'c'])
index = obj.index
index

Index([u'a', u'b', u'c'], dtype='object')

In [49]:
index[1:]

Index([u'b', u'c'], dtype='object')

In [50]:
#Index Object is immutable
index[1] = 'd'

TypeError: Indexes does not support mutable operations

In [164]:
index = pd.Index(np.arange(3))
obj2 = Series([1.5, -2.5, 0], index=index)
obj2.index is index

True

In [165]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [166]:
'Ohio' in frame3.columns

True

In [167]:
2003 in frame3.index

False

## Essential functionality

### Reindexing

In [168]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [169]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [170]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [171]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [172]:
frame = DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'],
                  columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [173]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a     0      1           2
b   NaN    NaN         NaN
c     3      4           5
d     6      7           8

In [174]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [175]:
frame.reindex(index=['a', 'b', 'c', 'd'], method='ffill',
              columns=states)

   Texas  Utah  California
a      1   NaN           2
b      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [176]:
frame.ix[['a', 'b', 'c', 'd'], states]

   Texas  Utah  California
a      1   NaN           2
b    NaN   NaN         NaN
c      4   NaN           5
d      7   NaN           8

### Dropping entries from an axis

In [177]:
obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
new_obj = obj.drop('c')
new_obj

a    0
b    1
d    3
e    4
dtype: float64

In [178]:
obj.drop(['d', 'c'])

a    0
b    1
e    4
dtype: float64

In [179]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])

In [180]:
data['two']['Ohio']

1

In [181]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [182]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [183]:
data.drop(['two', 'four'], axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

### Indexing, selection, and filtering

In [184]:
obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj['b']

1.0

In [185]:
obj[1]

1.0

In [186]:
obj[2:4]

c    2
d    3
dtype: float64

In [187]:
obj[['b', 'a', 'd']]

b    1
a    0
d    3
dtype: float64

In [188]:
obj[[1, 3]]

b    1
d    3
dtype: float64

In [189]:
obj[obj < 2]

a    0
b    1
dtype: float64

In [190]:
obj['b':'c']

b    1
c    2
dtype: float64

In [191]:
obj['b':'c'] = 5
obj

a    0
b    5
c    5
d    3
dtype: float64

In [192]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [193]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [194]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [195]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [196]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [197]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [198]:
data[data < 5] = 0

In [199]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [200]:
data.ix['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [201]:
data.ix[['Colorado', 'Utah'], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [202]:
data.ix[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [203]:
data.ix[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [204]:
data.ix[data.three > 5, :3]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

### Function application and mapping

In [205]:
frame = DataFrame(np.random.randn(4, 3), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [206]:
frame

               b         d         e
Utah   -0.341476 -0.960448  1.897574
Ohio   -1.962959  0.006161  0.993364
Texas  -2.260080 -1.334133  0.077989
Oregon  0.778863 -0.312382  0.940673

In [207]:
np.abs(frame)

               b         d         e
Utah    0.341476  0.960448  1.897574
Ohio    1.962959  0.006161  0.993364
Texas   2.260080  1.334133  0.077989
Oregon  0.778863  0.312382  0.940673

In [208]:
f = lambda x: x.max() - x.min()

In [209]:
frame.apply(f)

b    3.038943
d    1.340294
e    1.819585
dtype: float64

In [210]:
frame.apply(f, axis=1)

Utah      2.858022
Ohio      2.956322
Texas     2.338069
Oregon    1.253055
dtype: float64

In [211]:
def f(x):
    return Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f)

            b         d         e
min -2.260080 -1.334133  0.077989
max  0.778863  0.006161  1.897574

In [227]:
for item in frame.iteritems():
    print item

('b', Utah     -0.341476
Ohio     -1.962959
Texas    -2.260080
Oregon    0.778863
Name: b, dtype: float64)
('d', Utah     -0.960448
Ohio      0.006161
Texas    -1.334133
Oregon   -0.312382
Name: d, dtype: float64)
('e', Utah      1.897574
Ohio      0.993364
Texas     0.077989
Oregon    0.940673
Name: e, dtype: float64)

In [228]:
for item in frame.iterrows():
    print item

('Utah', b   -0.341476
d   -0.960448
e    1.897574
Name: Utah, dtype: float64)
('Ohio', b   -1.962959
d    0.006161
e    0.993364
Name: Ohio, dtype: float64)
('Texas', b   -2.260080
d   -1.334133
e    0.077989
Name: Texas, dtype: float64)
('Oregon', b    0.778863
d   -0.312382
e    0.940673
Name: Oregon, dtype: float64)

In [212]:
format = lambda x: '%.2f' % x
frame.applymap(format)

            b      d     e
Utah    -0.34  -0.96  1.90
Ohio    -1.96   0.01  0.99
Texas   -2.26  -1.33  0.08
Oregon   0.78  -0.31  0.94

In [63]:
frame['e'].map(format)

Utah       0.46
Ohio      -1.37
Texas     -2.04
Oregon     0.12
Name: e, dtype: object

### Sorting and ranking

In [64]:
obj = Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [160]:
frame = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'],
                  columns=['d', 'a', 'b', 'c'])
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [66]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [67]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [68]:
obj = Series([4, 7, -3, 2])
obj.order()

2   -3
3    2
0    4
1    7
dtype: int64

In [69]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])
obj.order()

4    -3
5     2
0     4
2     7
1   NaN
3   NaN
dtype: float64

In [70]:
frame = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [71]:
frame.sort_index(by='b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [72]:
frame.sort_index(by=['a', 'b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [73]:
obj = Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [74]:
obj.rank(method='first')

0    6
1    1
2    7
3    4
4    3
5    2
6    5
dtype: float64

In [75]:
obj.rank(ascending=False, method='max')

0    2
1    7
2    2
3    4
4    5
5    6
6    4
dtype: float64

In [76]:
frame = DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                   'c': [-2, 5, 8, -2.5]})
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [77]:
frame.rank(axis=1)

   a  b  c
0  2  3  1
1  1  3  2
2  2  1  3
3  2  3  1

## Summarizing and computing descriptive statistics

In [84]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5],
                [np.nan, np.nan], [0.75, -1.3]],
               index=['a', 'b', 'c', 'd'],
               columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [85]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [86]:
df.sum(axis=1)

a    1.40
b    2.60
c     NaN
d   -0.55
dtype: float64

In [87]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [88]:
df.idxmax()

one    b
two    d
dtype: object

In [89]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [90]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [91]:
obj = Series(['a', 'a', 'b', 'c'] * 4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

### Unique values, value counts, and membership

In [100]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [101]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [102]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [103]:
pd.value_counts(obj.values, sort=False)

a    3
c    3
b    2
d    1
dtype: int64

In [104]:
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [105]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [106]:
data = DataFrame({'Qu1': [1, 3, 4, 3, 4],
                  'Qu2': [2, 3, 1, 2, 3],
                  'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [107]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1    1    1    1
2    0    2    1
3    2    2    0
4    2    0    2
5    0    0    1

## Handling missing data

In [108]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [109]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [110]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Filtering out missing data

In [111]:
from numpy import nan as NA
data = Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [112]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [113]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA],
                  [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()
data

    0    1   2
0   1  6.5   3
1   1  NaN NaN
2 NaN  NaN NaN
3 NaN  6.5   3

In [114]:
cleaned

   0    1  2
0  1  6.5  3

In [115]:
data.dropna(how='all')

    0    1   2
0   1  6.5   3
1   1  NaN NaN
3 NaN  6.5   3

In [116]:
data[4] = NA
data

    0    1   2   4
0   1  6.5   3 NaN
1   1  NaN NaN NaN
2 NaN  NaN NaN NaN
3 NaN  6.5   3 NaN

In [117]:
data.dropna(axis=1, how='all')

    0    1   2
0   1  6.5   3
1   1  NaN NaN
2 NaN  NaN NaN
3 NaN  6.5   3

In [118]:
df = DataFrame(np.random.randn(7, 3))
df.ix[:4, 1] = NA; df.ix[:2, 2] = NA
df

          0         1         2
0 -0.707861       NaN       NaN
1  0.378104       NaN       NaN
2  1.055678       NaN       NaN
3 -2.464789       NaN  0.524434
4  2.035445       NaN  0.706011
5 -0.328831 -0.378008 -0.637036
6  0.670440  1.167536 -0.963443

In [119]:
df.dropna(thresh=3)

          0         1         2
5 -0.328831 -0.378008 -0.637036
6  0.670440  1.167536 -0.963443

### Filling in missing data

In [120]:
df.fillna(0)

          0         1         2
0 -0.707861  0.000000  0.000000
1  0.378104  0.000000  0.000000
2  1.055678  0.000000  0.000000
3 -2.464789  0.000000  0.524434
4  2.035445  0.000000  0.706011
5 -0.328831 -0.378008 -0.637036
6  0.670440  1.167536 -0.963443

In [229]:
df.fillna({1: 0.5, 2: -1})

          0         1         2
0 -0.681163 -0.351531  0.590488
1  0.033503 -0.603582 -0.103013
2 -1.568746  0.500000 -1.446788
3  0.170272  0.500000  0.702133
4  0.322001  0.500000 -1.000000
5  0.076043  0.500000 -1.000000

In [122]:
# always returns a reference to the filled object
_ = df.fillna(0, inplace=True)
df

          0         1         2
0 -0.707861  0.000000  0.000000
1  0.378104  0.000000  0.000000
2  1.055678  0.000000  0.000000
3 -2.464789  0.000000  0.524434
4  2.035445  0.000000  0.706011
5 -0.328831 -0.378008 -0.637036
6  0.670440  1.167536 -0.963443

In [123]:
df = DataFrame(np.random.randn(6, 3))
df.ix[2:, 1] = NA; df.ix[4:, 2] = NA
df

          0         1         2
0 -0.681163 -0.351531  0.590488
1  0.033503 -0.603582 -0.103013
2 -1.568746       NaN -1.446788
3  0.170272       NaN  0.702133
4  0.322001       NaN       NaN
5  0.076043       NaN       NaN

In [230]:
df.fillna(method='ffill')

          0         1         2
0 -0.681163 -0.351531  0.590488
1  0.033503 -0.603582 -0.103013
2 -1.568746 -0.603582 -1.446788
3  0.170272 -0.603582  0.702133
4  0.322001 -0.603582  0.702133
5  0.076043 -0.603582  0.702133

In [231]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -0.681163 -0.351531  0.590488
1  0.033503 -0.603582 -0.103013
2 -1.568746 -0.603582 -1.446788
3  0.170272 -0.603582  0.702133
4  0.322001       NaN  0.702133
5  0.076043       NaN  0.702133

In [126]:
data = Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [159]:
stacked.to_panel()

<class 'pandas.core.panel.Panel'>
Dimensions: 6 (items) x 903 (major_axis) x 4 (minor_axis)
Items axis: Open to Adj Close
Major_axis axis: 2012-05-30 00:00:00 to 2015-12-10 00:00:00
Minor_axis axis: AAPL to MSFT